{
  "_comment": "This file contains the CNN model architecture (Keras) used in the Emotional Recognition project.",
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 48, 48, 1],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "conv2d_input"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d",
          "trainable": true,
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
          "bias_initializer": {"class_name": "Zeros", "config": {}}
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {"name": "max_pooling2d", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}
      },
      {
        "class_name": "Dropout",
        "config": {"name": "dropout", "rate": 0.4}
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "activation": "relu",
          "use_bias": true
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}
      },
      {
        "class_name": "Dropout",
        "config": {"name": "dropout_1", "rate": 0.4}
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "filters": 512,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "activation": "relu",
          "use_bias": true
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}
      },
      {
        "class_name": "Dropout",
        "config": {"name": "dropout_2", "rate": 0.4}
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_3",
          "trainable": true,
          "filters": 512,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "activation": "relu",
          "use_bias": true
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}
      },
      {
        "class_name": "Dropout",
        "config": {"name": "dropout_3", "rate": 0.4}
      },
      {
        "class_name": "Flatten",
        "config": {"name": "flatten"}
      },
      {
        "class_name": "Dense",
        "config": {"name": "dense", "units": 512, "activation": "relu", "use_bias": true}
      },
      {
        "class_name": "Dropout",
        "config": {"name": "dropout_4", "rate": 0.4}
      },
      {
        "class_name": "Dense",
        "config": {"name": "dense_1", "units": 256, "activation": "relu", "use_bias": true}
      },
      {
        "class_name": "Dropout",
        "config": {"name": "dropout_5", "rate": 0.3}
      },
      {
        "class_name": "Dense",
        "config": {"name": "dense_2", "units": 7, "activation": "softmax", "use_bias": true}
      }
    ]
  },
  "keras_version": "2.10.0",
  "backend": "tensorflow"
}
